In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]

In [3]:
df = pd.DataFrame(friend_dict_list)

In [4]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [5]:
df = df[['name', 'age', 'job']]

In [6]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [7]:
from collections import OrderedDict

In [10]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [11]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [12]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [13]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [14]:
column_name = ['name', 'age', 'job']

In [15]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [23]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

발생한 오류는 from_items 메소드가 최신 버전의 pandas(버전 0.23.0 이후)에서 더 이상 사용되지 않고 제거되었기 때문에 발생합니다. 항목 목록이나 사전에서 DataFrame을 생성하려면 pd.DataFrame() 또는 pd.DataFrame.from_dict()와 같은 다른 메서드를 사용해야 합니다.

In [24]:
# friend_list = [
#     ['name', ['John', 'Nate']],
#     ['age', [20, 30]],
#     ['job', ['student', 'teacher']]
# ]

In [28]:
# df = pd.DataFrame(friend_list)

In [29]:
# df.head()